In [1]:
print("hello")

hello

this is a markdown cell to add all the text

In [1]:
!mkdir data

A subdirectory or file data already exists.

In [2]:
!mkdir -p data

A subdirectory or file data already exists.
Error occurred while processing: data.

In [4]:
%%writefile data/planets.csv
1,Earth
2,Mars
3,Jupiter

Writing data/planets.csv

In [3]:
import pandas as pd

In [7]:
pd.read_csv("data/planets.csv",header=None)

   0        1
0  1    Earth
1  2     Mars
2  3  Jupiter

In [4]:
df=pd.read_csv("data/planets.csv",header=None)
df

   0        1
0  1    Earth
1  2     Mars
2  3  Jupiter

In [5]:
df.columns= ["index","planets"]

In [6]:
df

   index  planets
0      1    Earth
1      2     Mars
2      3  Jupiter

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   index    3 non-null      int64
 1   planets  3 non-null      object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

In [12]:
df.iloc[1,1]

'Mars'

In [14]:
df.iloc[1:3]

   index  planets
1      2     Mars
2      3  Jupiter

In [7]:
df.iloc[1:3,1]

1       Mars
2    Jupiter
Name: planets, dtype: object

In [9]:
lst = [x for x in range(20)]
print(lst)

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19]

In [10]:
[str(x) for x in lst]

['0',
 '1',
 '2',
 '3',
 '4',
 '5',
 '6',
 '7',
 '8',
 '9',
 '10',
 '11',
 '12',
 '13',
 '14',
 '15',
 '16',
 '17',
 '18',
 '19']

In [12]:
lst1= [x for x in range(69,87)]
print (lst1)

[69, 70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82, 83, 84, 85, 86]

In [17]:
print(lst1[2:])

[71, 72, 73, 74, 75]

In [19]:
df= pd.read_csv("https://github.com/datalaker/assets/raw/main/data/data.csv")

In [20]:
df.head(10)

,name,age,street,city,state,zip,lng,lat
0,Jonathon Myers,41,87101 Ryan Plains Apt. 918,East Tamaraview,Montana,36335,-74.764331,-33.143414
1,Richard Moses,27,255 Walker Trail Apt. 235,Ballhaven,Nevada,11900,-24.597145,71.563941
2,Charles Smith,19,23460 Lauren Forges Suite 938,Hernandezside,Nevada,73620,160.219756,33.808708
3,Tammy Ford,79,848 Avila Neck Suite 892,Robbinsmouth,Vermont,43351,-64.448384,-28.593652
4,Kevin Becker,37,92571 Mackenzie Pine Suite 450,Wilsontown,Kansas,11496,146.620389,71.886168
5,Michael Austin,30,607 Joseph Port,Lisaland,Montana,83756,160.408082,74.409884
6,Michael Pham,40,45192 Warner Island Suite 625,Carlosport,Wyoming,40492,89.982682,74.844408
7,Reginald Wilcox,60,0015 Michael Vista,Port Kelly,North Dakota,63079,99.381437,-50.971717
8,Lindsey Smith,70,94344 Alyssa Expressway Apt. 233,North Sierrafort,Montana,30778,135.229537,-65.677517
9,Sandra Melendez,76,05093 Lester Gateway,Stewartfurt,Missouri,98276,-113.751849,-73.694152

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    1000 non-null   object
 1   age     1000 non-null   int64
 2   street  1000 non-null   object
 3   city    1000 non-null   object
 4   state   1000 non-null   object
 5   zip     1000 non-null   int64
 6   lng     1000 non-null   float64
 7   lat     1000 non-null   float64
dtypes: float64(2), int64(2), object(4)
memory usage: 62.6+ KB

In [23]:
df.loc[:,["city","state"]]

                city       state
0    East Tamaraview     Montana
1          Ballhaven      Nevada
2      Hernandezside      Nevada
3       Robbinsmouth     Vermont
4         Wilsontown      Kansas
..               ...         ...
995     Petersonview  New Mexico
996       Lake Katie      Nevada
997   Port Tracyberg   Tennessee
998     West Michael    Virginia
999    Davenportland     Georgia

[1000 rows x 2 columns]

In [25]:
df.loc[1:4,["city","state"]]

            city    state
1      Ballhaven   Nevada
2  Hernandezside   Nevada
3   Robbinsmouth  Vermont
4     Wilsontown   Kansas

In [27]:
df.iloc[1:4,[3,4]]

            city    state
1      Ballhaven   Nevada
2  Hernandezside   Nevada
3   Robbinsmouth  Vermont

In [33]:
df1=df.iloc[1:4,[3,4]]
df1.to_csv("location.csv.gz", index=None,compression="gzip")

In [34]:
lst=["a","b","c"]
{k:v for k,v in enumerate(lst)}

{0: 'a', 1: 'b', 2: 'c'}

In [39]:
x={0:'a',1:'b'}
x.items()
list(x.keys())
list(x.values())

['a', 'b']

In [40]:
y={'a':["earth","mars"],"b":["cricket","football"]}
print(y['a'][1])

mars

In [45]:
lst=['a','b','c']
for i,x in enumerate(lst):
    if i%2==0:
        {
            print(x)
        }

a
c

In [47]:
def mul(a,b):
    return a*b

print(mul(8,7))

56

In [50]:
x=5
while x>=2:
    print(x)
    x=x-1

5
4
3

In [2]:
import pandas as pd
df=pd.read_csv("https://github.com/datalaker/assets/raw/main/data/data.csv")

In [3]:
df.head(5)

,name,age,street,city,state,zip,lng,lat
0,Jonathon Myers,41,87101 Ryan Plains Apt. 918,East Tamaraview,Montana,36335,-74.764331,-33.143414
1,Richard Moses,27,255 Walker Trail Apt. 235,Ballhaven,Nevada,11900,-24.597145,71.563941
2,Charles Smith,19,23460 Lauren Forges Suite 938,Hernandezside,Nevada,73620,160.219756,33.808708
3,Tammy Ford,79,848 Avila Neck Suite 892,Robbinsmouth,Vermont,43351,-64.448384,-28.593652
4,Kevin Becker,37,92571 Mackenzie Pine Suite 450,Wilsontown,Kansas,11496,146.620389,71.886168

In [4]:
df[["lng","lat"]]

            lng        lat
0    -74.764331 -33.143414
1    -24.597145  71.563941
2    160.219756  33.808708
3    -64.448384 -28.593652
4    146.620389  71.886168
..          ...        ...
995   -9.854228  86.445643
996   68.936281 -51.308090
997   52.241034  -7.998483
998 -113.632353  49.893214
999  160.673878 -55.291305

[1000 rows x 2 columns]

In [6]:
df1=df[["lat","lng"]].head(5)
print(df1)

         lat         lng
0 -33.143414  -74.764331
1  71.563941  -24.597145
2  33.808708  160.219756
3 -28.593652  -64.448384
4  71.886168  146.620389

In [9]:
df1['latlong']= df1['lat']*df1['lng']
print(df1)

         lat         lng       latlong
0 -33.143414  -74.764331   2477.945137
1  71.563941  -24.597145  -1760.268634
2  33.808708  160.219756   5416.822946
3 -28.593652  -64.448384   1842.814664
4  71.886168  146.620389  10539.977916

In [13]:
df1['ll']= df1.apply(lambda row:row['lat']/2+row['lng'],axis=1)
print(df1)

         lat         lng       latlong          ll
0 -33.143414  -74.764331   2477.945137  -91.336038
1  71.563941  -24.597145  -1760.268634   11.184825
2  33.808708  160.219756   5416.822946  177.124110
3 -28.593652  -64.448384   1842.814664  -78.745210
4  71.886168  146.620389  10539.977916  182.563473

In [17]:
df={1:'a',2:'b'}
for k,v in df.items():
 if k%2==0:
     print(v)

b

In [21]:
def mul(a,b):
    return a*b

y=mul(5,4)
print(y)
print(mul(4,9))

20
36

In [22]:
import os
os.path.join('temp','temp.csv')

'temp\\temp.csv'

In [24]:
import csv
import os
header=['index','planets']
output=open(os.path.join('temp','temp.csv'),'w')
mywriter=csv.writer(output)
mywriter.writerow(header)
mywriter.writerow([1,'earth'])
output.close()